const express = require("express");
const indexRoute = express.Router();

destinations = [
  {
    name: "Lalibela",
    text: "ይህ የአማርኛ ጽሑፍ ነው ፡፡ ይህንን ቅጥያ ለማንኛውም ፕሮጀክት መጠቀሙን ይቀጥሉ ፣ እባክዎ አስተያየት ካለዎት ያሳውቁኝ ይህ የአማርኛ ጽሑፍ ነው ፡፡ ይህንን ቅጥያ ለማንኛውም ፕሮጀክት መጠቀሙን ይቀጥሉ ፣ እባክዎ አስተያየት ካለዎት ያሳውቁኝ ይህ የአማርኛ ጽሑፍ ነው ፡፡ ይህንን ቅጥያ ለማንኛውም ፕሮጀክት መጠቀሙን ይቀጥሉ ፣ እባክዎ አስተያየት ካለዎት ያሳውቁኝ",
  },
  {
    name: "AXUM",
    text: "ይህ የአማርኛ ጽሑፍ ነው ፡፡ ይህንን ቅጥያ ለማንኛውም ፕሮጀክት መጠቀሙን ይቀጥሉ ፣ እባክዎ አስተያየት ካለዎት ያሳውቁኝ ይህ የአማርኛ ጽሑፍ ነው ፡፡ ይህንን ቅጥያ ለማንኛውም ፕሮጀክት መጠቀሙን ይቀጥሉ ፣ እባክዎ አስተያየት ካለዎት ያሳውቁኝ ይህ የአማርኛ ጽሑፍ ነው ፡፡ ይህንን ቅጥያ ለማንኛውም ፕሮጀክት መጠቀሙን ይቀጥሉ ፣ እባክዎ አስተያየት ካለዎት ያሳውቁኝ",
  },
  {
    name: "GEDAM",
    text: "ይህ የአማርኛ ጽሑፍ ነው ፡፡ ይህንን ቅጥያ ለማንኛውም ፕሮጀክት መጠቀሙን ይቀጥሉ ፣ እባክዎ አስተያየት ካለዎት ያሳውቁኝ ይህ የአማርኛ ጽሑፍ ነው ፡፡ ይህንን ቅጥያ ለማንኛውም ፕሮጀክት መጠቀሙን ይቀጥሉ ፣ እባክዎ አስተያየት ካለዎት ያሳውቁኝ ይህ የአማርኛ ጽሑፍ ነው ፡፡ ይህንን ቅጥያ ለማንኛውም ፕሮጀክት መጠቀሙን ይቀጥሉ ፣ እባክዎ አስተያየት ካለዎት ያሳውቁኝ",
  },
];

indexRoute.get("/", (req, res) => {
  res.render("index");
});

indexRoute.get("/countryInfo/:id", (req, res) => {
  const destId = req.params.id;
  const dest = destinations[destId]
  res.render("countryInfo", {dest: dest});
});

module.exports = indexRoute;
